from matplotlib import pyplot as plt
import numpy as np



plt.minorticks_on()
plt.grid(visible=True, axis='both', which='major')
plt.grid(visible=True, axis='both', which='minor', alpha=0.2)


x = [0,15,30,45,60,75,90,105,120,135,150,165,180,195,210,225,240,255,270,285,300,315,330,345,360,375,390,405,420,435,450,465,480,495,510,525,540,555,570,585,600,615,630,645,660,675,690,705,720,735,750,765,780,795,810,825]
y = [240,235,229,225,225,225,224,224,224,224,223,223,223,223,223,223,223,222,222,222,222,221,221,219,213,207,203,198,193,189,184,180,176,173,169,165,162,159,156,153,150,147,144,141,139,136,133,131,129,126,124,122,120,118,116,114]
plt.plot(x, y, marker='.', color='black')
# plt.plot([0, 5.5], [0.265047517*0 + 6.3, 0.265047517*5.5 + 6.3], color='pink')


plt.legend(['$R_H(P)$', 'аппроксимация'])
plt.xlabel('$Мощность \ теплового \ потока, \ Вт$')
plt.ylabel('$Сопротивление \ R_H, \ Ом$')
plt.title('график зависимости $R_H(P)$')
plt.show()